*&---------------------------------------------------------------------*
*& Include zm_182_w3_i01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  EXIT  INPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE exit INPUT.        " PAI 설정. EXIT 모듈.
  CASE ok_code.           " 사용자의 행동은 OK_CODE 변수에 담아져있음
    WHEN 'BACK'.          " 사용자가 BACK 버튼을 누르면 SCREEN 0번으로 넘어감
      LEAVE TO SCREEN 0.
    WHEN 'EXIT' OR 'CANC'." 사용자가 EXIT, CANC 버튼을 누르면 PROGRAM을 나감.
      LEAVE PROGRAM.
  ENDCASE.
ENDMODULE.
